In [4]:
import numpy as np

In [3]:
import pandas as pd

In [5]:
label = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [10]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(data=my_data,index=label)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(my_data,label)

a    10
b    20
c    30
dtype: int64

In [13]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [14]:
pd.Series(arr,label)

a    10
b    20
c    30
dtype: int32

In [15]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [16]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [17]:
pd.Series(data=label)

0    a
1    b
2    c
dtype: object

In [19]:
pd.Series(data=[sum,len])

0    <built-in function sum>
1    <built-in function len>
dtype: object

In [20]:
ser1 = pd.Series([1,2,3,4], ['USA','Germany','USSR','Japan'])

In [21]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [22]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])

In [23]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [25]:
ser1['USA']

1

In [27]:
ser3 = pd.Series(data=label)

In [28]:
ser3[0]

'a'

In [29]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [30]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [31]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [32]:
from numpy.random import randn

In [34]:
np.random.seed(101)

In [35]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [40]:
type(df['W'])

pandas.core.series.Series

In [41]:
type(df['X'])

pandas.core.series.Series

# DataFrame: a set of series that share the same index

In [42]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [43]:
df.keys()

Index([u'W', u'X', u'Y', u'Z'], dtype='object')

In [46]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [49]:
df['new'] = df['W'] + df['Y']

In [50]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [52]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [54]:
df.drop('new',axis=1,inplace=True)

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
ser1 = pd.Series([1,2,3,4,5],['A','B','C','D','E'])
df['new'] = ser1

In [57]:
df

          W         X         Y         Z  new
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118 -0.319318 -0.848077  0.605965    2
C -2.018168  0.740122  0.528813 -0.589001    3
D  0.188695 -0.758872 -0.933237  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5

In [58]:
df.shape

(5, 5)

In [59]:
#selecting rows
df.loc['A']

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    1.000000
Name: A, dtype: float64

In [60]:
type(df.loc['A'])

pandas.core.series.Series

In [61]:
df.iloc[0]

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    1.000000
Name: A, dtype: float64

In [62]:
df.loc['B','Y']

-0.84807698340363147

In [63]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [67]:
df.iloc[[0,3],1]

A    0.628133
D   -0.758872
Name: X, dtype: float64

In [74]:
df > 0

       W      X      Y      Z   new
A   True   True   True   True  True
B   True  False  False   True  True
C  False   True   True  False  True
D   True  False  False   True  True
E   True   True   True   True  True

In [75]:
booldf = df > 0

In [76]:
booldf

       W      X      Y      Z   new
A   True   True   True   True  True
B   True  False  False   True  True
C  False   True   True  False  True
D   True  False  False   True  True
E   True   True   True   True  True

In [77]:
df[booldf]

          W         X         Y         Z  new
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118       NaN       NaN  0.605965    2
C       NaN  0.740122  0.528813       NaN    3
D  0.188695       NaN       NaN  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5

In [78]:
df[df>0]

          W         X         Y         Z  new
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118       NaN       NaN  0.605965    2
C       NaN  0.740122  0.528813       NaN    3
D  0.188695       NaN       NaN  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5

In [79]:
df[df['W']>0]

          W         X         Y         Z  new
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118 -0.319318 -0.848077  0.605965    2
D  0.188695 -0.758872 -0.933237  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5

In [83]:
df['W'] >0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [84]:
df[df['Z']<0]

          W         X         Y         Z  new
C -2.018168  0.740122  0.528813 -0.589001    3

In [86]:
resultdf = df[df['Z']<0]

In [88]:
resultdf['X']

C    0.740122
Name: X, dtype: float64

In [90]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [97]:
result = df[df['W']>0][['Y','X']]

In [101]:
result.loc[['A','B']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318

In [104]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z  new
E  0.190794  1.978757  2.605967  0.683509    5

In [105]:
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z  new
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118 -0.319318 -0.848077  0.605965    2
D  0.188695 -0.758872 -0.933237  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5

In [106]:
df

          W         X         Y         Z  new
A  2.706850  0.628133  0.907969  0.503826    1
B  0.651118 -0.319318 -0.848077  0.605965    2
C -2.018168  0.740122  0.528813 -0.589001    3
D  0.188695 -0.758872 -0.933237  0.955057    4
E  0.190794  1.978757  2.605967  0.683509    5

In [107]:
df.reset_index()

  index         W         X         Y         Z  new
0     A  2.706850  0.628133  0.907969  0.503826    1
1     B  0.651118 -0.319318 -0.848077  0.605965    2
2     C -2.018168  0.740122  0.528813 -0.589001    3
3     D  0.188695 -0.758872 -0.933237  0.955057    4
4     E  0.190794  1.978757  2.605967  0.683509    5

In [114]:
newind = 'CA NY WY OR CO'.split()

In [115]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [116]:
df['States'] = newind

In [117]:
df

          W         X         Y         Z  new States
A  2.706850  0.628133  0.907969  0.503826    1     CA
B  0.651118 -0.319318 -0.848077  0.605965    2     NY
C -2.018168  0.740122  0.528813 -0.589001    3     WY
D  0.188695 -0.758872 -0.933237  0.955057    4     OR
E  0.190794  1.978757  2.605967  0.683509    5     CO

In [121]:
df.drop('new', axis=1, inplace= True)

In [122]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [123]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [125]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [127]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [128]:
inside

[1, 2, 3, 1, 2, 3]

In [129]:
zip(outside,inside)

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [130]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [131]:
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [132]:
df.loc['G1']

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [133]:
df.loc['G1'].loc[1]

A    0.386030
B    2.084019
Name: 1, dtype: float64

In [134]:
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

In [136]:
df.index.names = ['Groups','Num']

In [137]:
df

                   A         B
Groups Num
G1     1    0.386030  2.084019
       2   -0.376519  0.230336
       3    0.681209  1.035125
G2     1   -0.031160  1.939932
       2   -1.005187 -0.741790
       3    0.187125 -0.732845

In [140]:
df.loc['G2'].loc[2]['B']

-0.74178970466892491

In [141]:
df

                   A         B
Groups Num
G1     1    0.386030  2.084019
       2   -0.376519  0.230336
       3    0.681209  1.035125
G2     1   -0.031160  1.939932
       2   -1.005187 -0.741790
       3    0.187125 -0.732845

In [142]:
df.loc['G1']

            A         B
Num
1    0.386030  2.084019
2   -0.376519  0.230336
3    0.681209  1.035125

In [143]:
df.xs('G1')

            A         B
Num
1    0.386030  2.084019
2   -0.376519  0.230336
3    0.681209  1.035125

In [146]:
df.xs(1,level='Num')

              A         B
Groups
G1      0.38603  2.084019
G2     -0.03116  1.939932

In [147]:
df.xs('A',axis=1)

Groups  Num
G1      1      0.386030
        2     -0.376519
        3      0.681209
G2      1     -0.031160
        2     -1.005187
        3      0.187125
Name: A, dtype: float64

In [148]:
df['A']

Groups  Num
G1      1      0.386030
        2     -0.376519
        3      0.681209
G2      1     -0.031160
        2     -1.005187
        3      0.187125
Name: A, dtype: float64

In [150]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [151]:
df = pd.DataFrame(d)

In [152]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [153]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [154]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [155]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [156]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [157]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [158]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [159]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [160]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [161]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [162]:
df = pd.DataFrame(data)

In [163]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [165]:
byComp = df.groupby('Company')

In [166]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [167]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [168]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [169]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [170]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [173]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [187]:
df.groupby('Company').describe().transpose()[['FB','GOOG']]

Company              FB        GOOG
Sales count    2.000000    2.000000
      mean   296.500000  160.000000
      std     75.660426   56.568542
      min    243.000000  120.000000
      25%    269.750000  140.000000
      50%    296.500000  160.000000
      75%    323.250000  180.000000
      max    350.000000  200.000000

In [3]:
df1 = pd.DataFrame({'A': ['A0','A1','A2','A3'], 'B': ['B0','B1','B2','B3'],'C': ['C0','C1','C2','C3'],'D': ['D0','D1','D2','D3']}, index=[0,1,2,3])

In [5]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [8]:
letras = ['A','B','C','D']
num = range(4,8)
num

[4, 5, 6, 7]

In [9]:
zip(letras,num)

[('A', 4), ('B', 5), ('C', 6), ('D', 7)]

In [10]:
data = []
for i in letras:
    for j in num:
        data.append(i+str(j))
print data

['A4', 'A5', 'A6', 'A7', 'B4', 'B5', 'B6', 'B7', 'C4', 'C5', 'C6', 'C7', 'D4', 'D5', 'D6', 'D7']

In [13]:
data_arr = np.array(data)

In [15]:
data_mat = np.reshape(data_arr,(4,4))

In [16]:
data_mat

array([['A4', 'A5', 'A6', 'A7'],
       ['B4', 'B5', 'B6', 'B7'],
       ['C4', 'C5', 'C6', 'C7'],
       ['D4', 'D5', 'D6', 'D7']],
      dtype='|S2')

In [22]:
type(data_mat)

numpy.ndarray

In [24]:
df2 = pd.DataFrame.from_records(data_mat,columns=['A','B','C','D'])

In [25]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [26]:
df2

    A   B   C   D
0  A4  A5  A6  A7
1  B4  B5  B6  B7
2  C4  C5  C6  C7
3  D4  D5  D6  D7

In [27]:
letras

['A', 'B', 'C', 'D']

In [28]:
num

[4, 5, 6, 7]

In [45]:
def gen_mat(letras, num, shape):
    data = []
    for i in letras:
        for j in num:
            data.append(i+str(j))
    return np.array(data).reshape((shape[0],shape[1]))

mat3 = gen_mat(letras,range(8,12),(4,4))

In [36]:
df3 = pd.DataFrame.from_records(mat3,columns=['A','B','C','D'])

In [37]:
df3

    A   B    C    D
0  A8  A9  A10  A11
1  B8  B9  B10  B11
2  C8  C9  C10  C11
3  D8  D9  D10  D11

# Concatenation

In [39]:
pd.concat([df1,df2,df3])

    A   B    C    D
0  A0  B0   C0   D0
1  A1  B1   C1   D1
2  A2  B2   C2   D2
3  A3  B3   C3   D3
0  A4  A5   A6   A7
1  B4  B5   B6   B7
2  C4  C5   C6   C7
3  D4  D5   D6   D7
0  A8  A9  A10  A11
1  B8  B9  B10  B11
2  C8  C9  C10  C11
3  D8  D9  D10  D11

In [40]:
pd.concat([df1,df2,df3],axis=1)

    A   B   C   D   A   B   C   D   A   B    C    D
0  A0  B0  C0  D0  A4  A5  A6  A7  A8  A9  A10  A11
1  A1  B1  C1  D1  B4  B5  B6  B7  B8  B9  B10  B11
2  A2  B2  C2  D2  C4  C5  C6  C7  C8  C9  C10  C11
3  A3  B3  C3  D3  D4  D5  D6  D7  D8  D9  D10  D11

In [59]:
mat4 = gen_mat(['K','A','B'],range(0,4),(3,4))
mat4
mat4 = mat4.transpose()

In [60]:
left = pd.DataFrame.from_records(data=mat4,columns=['key','A','B'])

In [61]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [62]:
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})

In [63]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [67]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [68]:
left = pd.DataFrame({'key1':['K0','K0','K1','K2'],
                    'key2':['K0','K1','K0','K1'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})

In [69]:
left

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [70]:
right = pd.DataFrame({'key1':['K0','K1','K1','K2'],
                    'key2':['K0','K0','K0','K0'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [71]:
right

    C   D key1 key2
0  C0  D0   K0   K0
1  C1  D1   K1   K0
2  C2  D2   K1   K0
3  C3  D3   K2   K0

In [75]:
# Merged by the two columns key1 and key2
pd.merge(left,right,on=['key1','key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [76]:
pd.merge(left, right,how='outer',on=['key1','key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [77]:
pd.merge(left, right,how='right',on=['key1','key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [78]:
left.set_index(['key1','key2'])

            A   B
key1 key2
K0   K0    A0  B0
     K1    A1  B1
K1   K0    A2  B2
K2   K1    A3  B3

In [80]:
left = pd.DataFrame({'A':['A0','A1','A2'],
                    'B':['B0','B1','B2']},index=['K0','K1','K2'])

In [81]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [88]:
right = pd.DataFrame({'C':['C0','C1','C2'],
                    'D':['D0','D1','D2']},index=['K0','K2','K3'])

In [89]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [90]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [91]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

In [97]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [98]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [99]:
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [102]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [103]:
df['col2'].nunique()

3

In [104]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [105]:
df['col1'].sum()

10

In [106]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [107]:
df.columns

Index([u'col1', u'col2', u'col3'], dtype='object')

In [108]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [109]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [110]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [111]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [112]:
df = pd.DataFrame(data)

In [113]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [119]:
df.pivot_table(index=['A','B'],values='D',columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [6]:
df = pd.read_csv("example.csv")

In [7]:
df

        ;A;B;C;D
0  0;A0;B0;C0;D0
1  1;A1;B1;C1;D1
2  2;A2;B2;C2;D2
3  3;A3;B3;C3;D3

In [8]:
df.to_csv('My_output',index=False)

In [9]:
pd.read_csv('My_output')

        ;A;B;C;D
0  0;A0;B0;C0;D0
1  1;A1;B1;C1;D1
2  2;A2;B2;C2;D2
3  3;A3;B3;C3;D3

In [41]:
df = pd.read_excel('Example_Excel.xlsx',sheetname='Hoja1',index=False)

In [42]:
df.to_excel("Excel_Sample2.xlsx")

In [43]:
df

    a   b   c   d
0  10  20  30  40
1   a   b   c   d
2  50  60  70  80
3   e   f   g   h

In [5]:
data = pd.read_html('http://www.sii.cl/valores_y_fechas/uf/uf2017.htm')

In [6]:
type(data)

list

In [29]:
data[0]

            0         1     2         3     4         5
0   Diciembre       NaN   NaN       NaN   NaN       NaN
1           1  26.73645  11.0  26.78087  21.0  26.78950
2           2  26.74178  12.0  26.78173  22.0  26.79037
3           3  26.74712  13.0  26.78259  23.0  26.79123
4           4  26.75245  14.0  26.78346  24.0  26.79209
5           5  26.75779  15.0  26.78432  25.0  26.79296
6           6  26.76312  16.0  26.78518  26.0  26.79382
7           7  26.76846  17.0  26.78605  27.0  26.79469
8           8  26.77380  18.0  26.78691  28.0  26.79555
9           9  26.77914  19.0  26.78778  29.0  26.79641
10         10  26.78000  20.0  26.78864  30.0  26.79728
11        NaN       NaN   NaN       NaN  31.0  26.79814

In [30]:
from sqlalchemy import create_engine

In [31]:
engine = create_engine('sqlite:///:memory:')

In [50]:
df.to_sql('my_table',engine, index=False, if_exists='replace')

In [53]:
data_sql = pd.read_sql('my_table',engine)

In [54]:
data_sql

    a   b   c   d
0  10  20  30  40
1   a   b   c   d
2  50  60  70  80
3   e   f   g   h